app/Http/Controllers/ContactController.php

    public function formBands() {
        $musicStyleOptions = MusicStyle::orderBy('name')->get()->keyBy('id')->map->name;
---
select * from `music_style` order by `name` asc