app/Models/Event.php

    public function scopeByCategorySlug(Builder $query, $slug, $sinceToday = true)
    {
        $result = $query
            ->with(['category','theme'])
            ->where('is_published', 1)
            ->when($sinceToday, function($query) {
                return $query->whereDate('event_date','>=', MyDate::getUntilValidDate());
            })
            ->whereHas('category', function($query) use ($slug) {
                $query->where('slug', $slug);
            });
---
select * from `category` where `category`.`id` in (1)
select * from `event` where `is_published` = 1 and date(`event_date`) >= '2021-09-25' order by `event_date` asc
select * from `theme` where `theme`.`id` in (1)