app/Http/Controllers/Admin/EventController.php

            function (Builder $query) use ($request) {
                $query->with(['category','theme','createdBy','updatedBy']);
                if($request->has('category')){
                    $query->where('category_id', $request->get('category'));
                }
                if($request->has('theme')){
                    $query->where('theme_id', $request->get('theme'));
                }
                $query
                    ->whereDate('event_date','>=', MyDate::getUntilValidDate())
                    ->orderBy('event_date', 'DESC')
                ;
            }
        );

        if ($request->ajax()) {
            if ($request->has('bulk')) {
                return [
                    'bulkItems' => $data->pluck('id')
                ];
            }
            return ['data' => $data];
        }

        return view('admin.event.index', [
            'data'          => $data,
            'categories'    => Category::all(['id', 'name']),
            'themes'        => Theme::all(['id', 'name']),
---
select `id`, `name` from `category`
select `id`, `name` from `theme`

    public function create()
    {
        $this->authorize('event.create');

        return view('admin.event.create', [
            'categories'    => Category::all(['id', 'name']),
            'themes'        => Theme::all(['id', 'name']),
        ]);
---
select `id`, `name` from `category`
select `id`, `name` from `theme`