app/Http/Controllers/Admin/MenuController.php

	public function show()
    {
        $publicRoutes = array_flip(MyRoutes::getPublicRoutes()->toArray());
        ksort($publicRoutes);
        try {
			$options = [
                'menuItemTypeOptions' => MenuItemType::all()->keyBy('id')->map->label,
                'publicRoutes' => $publicRoutes,
				'title' => $this->title,
			];
---
select * from `menu_item_type`

	public function operation( $operation )
	{
		/**
		 * @var Menu $parent
		 * @var NestedSet $node
		 */
		$request		= request();
		$id				= ('#' === $request->get('id')) ? null : (int)$request->get('id');
		$text			= $request->get('text');
		$parentId		= (int)$request->get('parent');
		$oldParentId	= (int)$request->get('old_parent');
		$parent			= Menu::withDepth()->find($parentId) ?: null;
		$lvl			= $parent ? $parent->depth + 1 : 1;
		$position		= $request->get('position');
		$oldPosition	= $request->get('old_position');
		$result			= ['error' => true];

		switch($operation) {
			case 'get_node':
				if ( null === $id ) {
					$data = Menu::defaultOrder()->whereNull('parent_id')->with('descendants')->get();
//                    $data = Menu::defaultOrder()->where('parent_id', null)->get();
				} else {
					$data = Menu::defaultOrder()->descendantsOf($id)->toTree();
				}
				$result = [];
				if( $data->count() > 0 ) {
---
select * from `menu` where `menu`.`parent_id` = 1 and `menu`.`parent_id` is not null

				}
				break;
			case 'get_content':
				$node = Menu::with('ancestors')->find($id);
---
select * from `menu` where `menu`.`id` = 1 limit 1

				];
				break;
			case 'delete_node':
				$result = [
					'id' 		=> $id,
					'delete'	=> Menu::find($id)->delete(),
				];
---
delete from `menu` where `id` = 29