app/Repositories/EventPeriodicRepository.php

select * from `category` where `category`.`id` in (1)
select * from `theme` where `theme`.`id` in (1)
---
    public function getAllPeriodicDates($formated = true, $isPublic = false)
    {
        $entities = EventPeriodic::all()->load(['category','theme'])
            ->where('is_published', 1)