app/Repositories/MenuRepository.php

select * from `menu_item_type` where `type` = 'topMenuRoot' limit 1
select `id` from `menu` where `menu_item_type_id` = 4 limit 1
---
    public function getTopMenu($forApi = false) {
        $topMenuType    = MenuItemType::where('type', 'topMenuRoot')->first();
        $topMenu 	    = Menu::select(['id'])->where('menu_item_type_id', $topMenuType->id)->first();

select * from `menu_item_type` where `type` = 'bottomMenuRoot' limit 1
select `id` from `menu` where `menu_item_type_id` = 5 limit 1
---
    public function getBottomMenu($forApi = false) {
        $bottomMenuType	= MenuItemType::where('type', 'bottomMenuRoot')->first();
        $bottomMenu 	= Menu::select(['id'])->where('menu_item_type_id', $bottomMenuType->id)->first();